tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"

brew "fish"
brew "fisher"
brew "gnupg"
brew "pinentry-mac"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "bat"
brew "neovim"
brew "git-delta"
brew "gh"

cask "keepassxc"
cask "kitty"
cask "visual-studio-code"
cask "obsidian"
cask "vmware-horizon-client"

vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "humao.rest-client"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
